app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 762146111]]
---
<span><%= link_to "浏览本地资源", current_user %></span>
<span>微博数：<%= current_user.microposts.count %></span>